RT-Thread/rt-thread/bsp/n32/libraries/N32L40x_Firmware_Library/n32l40x_std_periph_driver/inc/n32l40x_lcd.h
/** @brief Select internal VLCD as LCD voltage source
  * @param  None
  * @retval None
  */
#define __LCD_SELECT_INTERNAL_VLCD()        CLEAR_BIT(LCD->CTRL, LCD_CTRL_VSEL)

/** @brief Select external VLCD as LCD voltage source
  * @param  None
  * @retval None
  */
#define __LCD_SELECT_EXTERNAL_VLCD()        SET_BIT(LCD->CTRL, LCD_CTRL_VSEL)

/** @brief Enable the LCD high driver mode.
  * @param  None
  * @retval None
  */
#define __LCD_HIGHDRIVE_ENABLE()            SET_BIT(LCD->FCTRL, LCD_FCTRL_HDEN)

/** @brief Disable the LCD high driver mode.
  * @param  None
  * @retval None
  */
#define __LCD_HIGHDRIVE_DISABLE()           CLEAR_BIT(LCD->FCTRL, LCD_FCTRL_HDEN)

/** @brief Config the prescaler factor
  * @param  __PRES__ specifies the LCD prescaler
  *   This parameter can be one of the following values:
  *     @arg LCD_PRESCALER_1:       CLKPS = LCDCLK
  *     @arg LCD_PRESCALER_2:       CLKPS = LCDCLK/2
  *     @arg LCD_PRESCALER_4:       CLKPS = LCDCLK/4
  *     @arg LCD_PRESCALER_8:       CLKPS = LCDCLK/8
  *     @arg LCD_PRESCALER_16:      CLKPS = LCDCLK/16
  *     @arg LCD_PRESCALER_32:      CLKPS = LCDCLK/32
  *     @arg LCD_PRESCALER_64:      CLKPS = LCDCLK/64
  *     @arg LCD_PRESCALER_128:     CLKPS = LCDCLK/128
  *     @arg LCD_PRESCALER_256:     CLKPS = LCDCLK/256
  *     @arg LCD_PRESCALER_512:     CLKPS = LCDCLK/512
  *     @arg LCD_PRESCALER_1024:    CLKPS = LCDCLK/1024
  *     @arg LCD_PRESCALER_2048:    CLKPS = LCDCLK/2048
  *     @arg LCD_PRESCALER_4096:    CLKPS = LCDCLK/4096
  *     @arg LCD_PRESCALER_8192:    CLKPS = LCDCLK/8192
  *     @arg LCD_PRESCALER_16384:   CLKPS = LCDCLK/16384
  *     @arg LCD_PRESCALER_32768:   CLKPS = LCDCLK/32768
  * @retval None
  */
#define __LCD_PRESCALER_CONFIG(__PRES__)    MODIFY_REG(LCD->FCTRL, LCD_FCTRL_PRES,__PRES__)

/** @brief Config the divider factor
  * @param  __DIV__ specifies the LCD divider
  *   This parameter can be one of the following values:
  *     @arg LCD_DIV_16:   CLKDIV = CLKPS/(16)
  *     @arg LCD_DIV_17:   CLKDIV = CLKPS/(17)
  *     @arg LCD_DIV_18:   CLKDIV = CLKPS/(18)
  *     @arg LCD_DIV_19:   CLKDIV = CLKPS/(19)
  *     @arg LCD_DIV_20:   CLKDIV = CLKPS/(20)
  *     @arg LCD_DIV_21:   CLKDIV = CLKPS/(21)
  *     @arg LCD_DIV_22:   CLKDIV = CLKPS/(22)
  *     @arg LCD_DIV_23:   CLKDIV = CLKPS/(23)
  *     @arg LCD_DIV_24:   CLKDIV = CLKPS/(24)
  *     @arg LCD_DIV_25:   CLKDIV = CLKPS/(25)
  *     @arg LCD_DIV_26:   CLKDIV = CLKPS/(26)
  *     @arg LCD_DIV_27:   CLKDIV = CLKPS/(27)
  *     @arg LCD_DIV_28:   CLKDIV = CLKPS/(28)
  *     @arg LCD_DIV_29:   CLKDIV = CLKPS/(29)
  *     @arg LCD_DIV_30:   CLKDIV = CLKPS/(30)
  *     @arg LCD_DIV_31:   CLKDIV = CLKPS/(31)
  * @retval None
  */
#define __LCD_DIVIDER_CONFIG(__DIV__)       MODIFY_REG(LCD->FCTRL, LCD_FCTRL_DIV,__DIV__)

/** @brief Config the blink mode and frequency
  * @param  __BLINKMODE__ specifies the LCD blink mode
  *   This parameter can be one of the following values:
  *     @arg LCD_DIV_16:   CLKDIV = CLKPS/(16)
  *     @arg LCD_BLINKMODE_OFF:             Blink disable
  *     @arg LCD_BLINKMODE_SEG0_COM0:       Blink enabled on SEG[0], COM[0] (1 pixel)
  *     @arg LCD_BLINKMODE_SEG0_ALLCOM:     Blink enabled on SEG[0], all COM (up to 8 pixels according to the programmed duty)
  *     @arg LCD_BLINKMODE_ALLSEG_ALLCOM:   Blink enabled on all SEG and all COM (all pixels)
  * @param  __BLINKFREQUENCY__ specifies the LCD blink frequency
  *   This parameter can be one of the following values:
  *     @arg LCD_BLINKFREQ_DIV_8:       The Blink frequency = fck_div/8
  *     @arg LCD_BLINKFREQ_DIV_16:      The Blink frequency = fck_div/16
  *     @arg LCD_BLINKFREQ_DIV_32:      The Blink frequency = fck_div/32
  *     @arg LCD_BLINKFREQ_DIV_64:      The Blink frequency = fck_div/64
  *     @arg LCD_BLINKFREQ_DIV_128:     The Blink frequency = fck_div/128
  *     @arg LCD_BLINKFREQ_DIV_256:     The Blink frequency = fck_div/256
  *     @arg LCD_BLINKFREQ_DIV_512:     The Blink frequency = fck_div/512
  *     @arg LCD_BLINKFREQ_DIV_1024:    The Blink frequency = fck_div/1024
  * @retval None
  */
#define __LCD_BLINK_CONFIG(__BLINKMODE__,__BLINKFREQUENCY__)    MODIFY_REG(LCD->FCTRL, (LCD_FCTRL_BLINK|LCD_FCTRL_BLINKF),(__BLINKMODE__|__BLINKFREQUENCY__))


/** @brief Config the contrast
  * @param  __CONTRAST__ specifies the LCD contrast
  *   This parameter can be one of the following values:
  *     @arg LCD_CONTRASTLEVEL_0:   Maximum Voltage = 2.60V
  *     @arg LCD_CONTRASTLEVEL_1:   Maximum Voltage = 2.73V
  *     @arg LCD_CONTRASTLEVEL_2:   Maximum Voltage = 2.86V
  *     @arg LCD_CONTRASTLEVEL_3:   Maximum Voltage = 2.99V
  *     @arg LCD_CONTRASTLEVEL_4:   Maximum Voltage = 3.12V
  *     @arg LCD_CONTRASTLEVEL_5:   Maximum Voltage = 3.26V
  *     @arg LCD_CONTRASTLEVEL_6:   Maximum Voltage = 3.40V
  *     @arg LCD_CONTRASTLEVEL_7:   Maximum Voltage = 3.55V
  * @retval None
  */
#define __LCD_CONTRAST_CONFIG(__CONTRAST__)    MODIFY_REG(LCD->FCTRL, LCD_FCTRL_CONTRAST,__CONTRAST__)

/** @brief Config the dead time
  * @param  __CONTRAST__ specifies the LCD dead time
  *   This parameter can be one of the following values:
  *     @arg LCD_DEADTIME_0: No dead Time
  *     @arg LCD_DEADTIME_1: One Phase between different couple of Frame
  *     @arg LCD_DEADTIME_2: Two Phase between different couple of Frame
  *     @arg LCD_DEADTIME_3: Three Phase between different couple of Frame
  *     @arg LCD_DEADTIME_4: Four Phase between different couple of Frame
  *     @arg LCD_DEADTIME_5: Five Phase between different couple of Frame
  *     @arg LCD_DEADTIME_6: Six Phase between different couple of Frame
  *     @arg LCD_DEADTIME_7: Seven Phase between different couple of Frame
  * @retval None
  */
#define __LCD_DEADTIME_CONFIG(__DEADTIME__)    MODIFY_REG(LCD->FCTRL, LCD_FCTRL_DEAD,__DEADTIME__)

/** @brief Config the pulse on duration
  * @param __PULSEON__ specifies the LCD pulse on duration in terms of
  *         CK_PS (prescaled LCD clock period) pulses.
  *   This parameter can be one of the following values:
  *     @arg LCD_PULSEONDURATION_0: 0 pulse
  *     @arg LCD_PULSEONDURATION_1: Pulse ON duration = 1/CK_PS
  *     @arg LCD_PULSEONDURATION_2: Pulse ON duration = 2/CK_PS
  *     @arg LCD_PULSEONDURATION_3: Pulse ON duration = 3/CK_PS
  *     @arg LCD_PULSEONDURATION_4: Pulse ON duration = 4/CK_PS
  *     @arg LCD_PULSEONDURATION_5: Pulse ON duration = 5/CK_PS
  *     @arg LCD_PULSEONDURATION_6: Pulse ON duration = 6/CK_PS
  *     @arg LCD_PULSEONDURATION_7: Pulse ON duration = 7/CK_PS
  * @retval None
  */
#define __LCD_PULSEONDURATION_CONFIG(__PULSEON__)       MODIFY_REG(LCD->FCTRL, LCD_FCTRL_PULSEON,__PULSEON__)

/** @brief  Enable the specified LCD interrupt.
  * @param __INTERRUPT__ specifies the LCD interrupt source to be enabled.
  *          This parameter can be one of the following values:
  *     @arg LCD_IT_SOF: Start of Frame Interrupt
  *     @arg LCD_IT_UDD: Update Display Done Interrupt
  * @retval None
  */
#define __LCD_ENABLE_IT(__INTERRUPT__)                  SET_BIT(LCD->FCTRL, __INTERRUPT__)

/** @brief  Disable the specified LCD interrupt.
  * @param __INTERRUPT__ specifies the LCD interrupt source to be disabled.
  *          This parameter can be one of the following values:
  *     @arg LCD_IT_SOF: Start of Frame Interrupt
  *     @arg LCD_IT_UDD: Update Display Done Interrupt
  * @retval None
  */
#define __LCD_DISABLE_IT(__INTERRUPT__)                 CLEAR_BIT(LCD->FCTRL, __INTERRUPT__)

/** @brief  Check whether the specified LCD interrupt source is enabled or not.
  * @param __INTERRUPT__ specifies the LCD interrupt source to check.
  *        This parameter can be one of the following values:
  *        @arg LCD_IT_SOF: Start of Frame Interrupt
  *        @arg LCD_IT_UDD: Update Display Done Interrupt.
  * @retval The state of __INTERRUPT__
  */
#define __LCD_GET_IT_SOURCE(__INTERRUPT__)              ((LCD->FCTRL) & (__INTERRUPT__))

/** @brief  Set LCD UDR flag for update dispaly request
  * @param  None
  * @retval None
  */
#define __LCD_UPDATE_REQUEST()              SET_BIT(LCD->STS, LCD_FLAG_UDR)

/** @brief  Check whether the specified LCD flag is set or not.
  * @param __FLAG__ specifies the flag to check.
  *        This parameter can be one of the following values:
  *        @arg LCD_FLAG_ENS: LCD Enabled flag. It indicates the LCD controller status.
  * @note  The ENS bit is set immediately when the LCDEN bit in the LCD_CR
  *             goes from 0 to 1. On deactivation it reflects the real status of
  *             LCD so it becomes 0 at the end of the last displayed frame.
  *        @arg LCD_FLAG_SOF: Start of Frame flag. This flag is set by hardware at
  *             the beginning of a new frame, at the same time as the display data is
  *             updated.
  *        @arg LCD_FLAG_UDR: Update Display Request flag.
  *        @arg LCD_FLAG_UDD: Update Display Done flag.
  *        @arg LCD_FLAG_RDY: Step_up converter Ready flag. It indicates the status
  *             of the step-up converter.
  *        @arg LCD_FLAG_FCRSF: LCD Frame Control Register Synchronization Flag.
  *             This flag is set by hardware each time the LCD_FCR register is updated
  *             in the LCDCLK domain.
  * @retval The new state of __FLAG__
  */
#define __LCD_GET_FLAG(__FLAG__)            (((LCD->STS) & (__FLAG__)) == (__FLAG__))

/** @brief  Clear the specified LCD pending flag.
  * @param __FLAG__ specifies the flag to clear.
  *        This parameter can be any combination of the following values:
  *        @arg LCD_FLAG_SOF_CLEAR: Start of Frame Interrupt
  *        @arg LCD_FLAG_UDD_CLEAR: Update Display Done Interrupt
  * @retval None
  */
#define __LCD_CLEAR_FLAG(__FLAG__)                                  \
                    do  {                                           \
                            SET_BIT((LCD->CLR), (__FLAG__));        \
                            CLEAR_BIT((LCD->CLR), (__FLAG__));      \
                        }while (0)

