RT-Thread/rt-thread/bsp/n32/libraries/N32L40x_Firmware_Library/n32l40x_std_periph_driver/inc/n32l40x_lcd.h
/** @brief  Config LCD to keep display in STOP2 mode.
  * @param  None
  * @retval None
  */
#define __LCD_DISPLAY_IN_STOP2()                                                        \
                    do  {                                                               \
                            SET_BIT(*(__IO uint32_t *)(PWR_BASE+0x08), (0x1UL << 21));  \
                            CLEAR_BIT(*(__IO uint32_t *)(PWR_BASE+0x1c), (0x1UL << 7)); \
                        }while (0)

/* Private macros ------------------------------------------------------------*/
/** @defgroup LCD_Private_Macros LCD Private Macros
  * @{
  */
#define IS_LCD_RAM_REGISTER_INDEX(__RAMRegIndex__)    ((__RAMRegIndex__)<=LCD_RAM2_COM7)

#define IS_LCD_PRESCALER(_PRESCALER_)   \
        (((_PRESCALER_)==LCD_PRESCALER_1)    ||((_PRESCALER_)==LCD_PRESCALER_2)     \
        ||((_PRESCALER_)==LCD_PRESCALER_4)   ||((_PRESCALER_)==LCD_PRESCALER_8)     \
        ||((_PRESCALER_)==LCD_PRESCALER_16)  ||((_PRESCALER_)==LCD_PRESCALER_32)    \
        ||((_PRESCALER_)==LCD_PRESCALER_64)  ||((_PRESCALER_)==LCD_PRESCALER_128)   \
        ||((_PRESCALER_)==LCD_PRESCALER_256) ||((_PRESCALER_)==LCD_PRESCALER_512)   \
        ||((_PRESCALER_)==LCD_PRESCALER_1024)||((_PRESCALER_)==LCD_PRESCALER_2048)  \
        ||((_PRESCALER_)==LCD_PRESCALER_4096)||((_PRESCALER_)==LCD_PRESCALER_8192)  \
        ||((_PRESCALER_)==LCD_PRESCALER_16384)||((_PRESCALER_)==LCD_PRESCALER_32768))

#define IS_LCD_DIVIDER(__DIVIDER__)   \
        (((__DIVIDER__)==LCD_DIV_16)||((__DIVIDER__)==LCD_DIV_17)||((__DIVIDER__)==LCD_DIV_18)      \
        ||((__DIVIDER__)==LCD_DIV_19)||((__DIVIDER__)==LCD_DIV_20)||((__DIVIDER__)==LCD_DIV_21)     \
        ||((__DIVIDER__)==LCD_DIV_22)||((__DIVIDER__)==LCD_DIV_23)||((__DIVIDER__)==LCD_DIV_24)     \
        ||((__DIVIDER__)==LCD_DIV_25)||((__DIVIDER__)==LCD_DIV_26)||((__DIVIDER__)==LCD_DIV_27)     \
        ||((__DIVIDER__)==LCD_DIV_28)||((__DIVIDER__)==LCD_DIV_29)||((__DIVIDER__)==LCD_DIV_30)     \
        ||((__DIVIDER__)==LCD_DIV_31))

#define IS_LCD_DUTY(__DUTY__)   \
        (((__DUTY__)==LCD_DUTY_STATIC)||((__DUTY__)==LCD_DUTY_1_2)    \
        ||((__DUTY__)==LCD_DUTY_1_3)   ||((__DUTY__)==LCD_DUTY_1_4)   \
        ||((__DUTY__)==LCD_DUTY_1_8) )

#define IS_LCD_BIAS(__BIAS__)   \
        (((__BIAS__)==LCD_BIAS_1_2)||((__BIAS__)==LCD_BIAS_1_3)||((__BIAS__)==LCD_BIAS_1_4))

#define IS_LCD_VOLTAGESOURCE(__SOURCE__)   \
        (((__SOURCE__)==LCD_VOLTAGESOURCE_INTERNAL)||((__SOURCE__)==LCD_VOLTAGESOURCE_EXTERNAL))

#define IS_LCD_CONTRASTLEVEL(__CONTRAST__)   \
        (((__CONTRAST__)==LCD_CONTRASTLEVEL_0) ||((__CONTRAST__)==LCD_CONTRASTLEVEL_1)    \
        ||((__CONTRAST__)==LCD_CONTRASTLEVEL_2) ||((__CONTRAST__)==LCD_CONTRASTLEVEL_3)   \
        ||((__CONTRAST__)==LCD_CONTRASTLEVEL_4) ||((__CONTRAST__)==LCD_CONTRASTLEVEL_5)   \
        ||((__CONTRAST__)==LCD_CONTRASTLEVEL_6) ||((__CONTRAST__)==LCD_CONTRASTLEVEL_7))

#define IS_LCD_DEADTIME(__DEADTIME__)   \
        (((__DEADTIME__)==LCD_DEADTIME_0) ||((__DEADTIME__)==LCD_DEADTIME_1)      \
        ||((__DEADTIME__)==LCD_DEADTIME_2) ||((__DEADTIME__)==LCD_DEADTIME_3)     \
        ||((__DEADTIME__)==LCD_DEADTIME_4) ||((__DEADTIME__)==LCD_DEADTIME_5)     \
        ||((__DEADTIME__)==LCD_DEADTIME_6) ||((__DEADTIME__)==LCD_DEADTIME_7))

#define IS_LCD_PULSEONDURATION(__PULSE__)   \
        (((__PULSE__)==LCD_PULSEONDURATION_0) ||((__PULSE__)==LCD_PULSEONDURATION_1)    \
        ||((__PULSE__)==LCD_PULSEONDURATION_2) ||((__PULSE__)==LCD_PULSEONDURATION_3)   \
        ||((__PULSE__)==LCD_PULSEONDURATION_4) ||((__PULSE__)==LCD_PULSEONDURATION_5)   \
        ||((__PULSE__)==LCD_PULSEONDURATION_6) ||((__PULSE__)==LCD_PULSEONDURATION_7))

#define IS_LCD_HIGHDRIVE(__HIGHDRIVE__)   \
        ((((__HIGHDRIVE__))==LCD_HIGHDRIVE_DISABLE)||(((__HIGHDRIVE__))==LCD_HIGHDRIVE_ENABLE))

#define IS_LCD_HIGHDRIVEBUFFER(__HIGHDRIVEBUF__)   \
        (((__HIGHDRIVEBUF__)==LCD_HIGHDRIVEBUFFER_DISABLE)||((__HIGHDRIVEBUF__)==LCD_HIGHDRIVEBUFFER_ENABLE))

#define IS_LCD_BLINKMODE(__BLINKMODE__)   \
        (((__BLINKMODE__)==LCD_BLINKMODE_OFF)          ||((__BLINKMODE__)==LCD_BLINKMODE_SEG0_COM0)         \
        ||((__BLINKMODE__)==LCD_BLINKMODE_SEG0_ALLCOM) ||((__BLINKMODE__)==LCD_BLINKMODE_ALLSEG_ALLCOM))

#define IS_LCD_BLINKFREQ(__BLINKFREQ__)   \
        (((__BLINKFREQ__)==LCD_BLINKFREQ_DIV_8)   ||((__BLINKFREQ__)==LCD_BLINKFREQ_DIV_16)     \
        ||((__BLINKFREQ__)==LCD_BLINKFREQ_DIV_32) ||((__BLINKFREQ__)==LCD_BLINKFREQ_DIV_64)     \
        ||((__BLINKFREQ__)==LCD_BLINKFREQ_DIV_128) ||((__BLINKFREQ__)==LCD_BLINKFREQ_DIV_256)   \
        ||((__BLINKFREQ__)==LCD_BLINKFREQ_DIV_512) ||((__BLINKFREQ__)==LCD_BLINKFREQ_DIV_1024))

#define IS_LCD_MUXSEGMENT(__MUXSEG__)   \
        (((__MUXSEG__)==LCD_MUXSEGMENT_DISABLE)||((__MUXSEG__)==LCD_MUXSEGMENT_ENABLE))

#define IS_LCD_FLAG(__FLAG__) \
        (((__FLAG__)==LCD_FLAG_ENSTS)||((__FLAG__)==LCD_FLAG_SOF)       \
        ||((__FLAG__)==LCD_FLAG_UDR)||((__FLAG__)==LCD_FLAG_UDD)      \
        ||((__FLAG__)==LCD_FLAG_RDY)||((__FLAG__)==LCD_FLAG_FCRSF))

#define IS_LCD_CLR_FLAG(__CLEARFLAG__)    (((__CLEARFLAG__)==LCD_FLAG_SOF_CLEAR)||((__CLEARFLAG__)==LCD_FLAG_UDD_CLEAR)


/**
  * @brief LCD Init structure definition
  */

typedef struct
{
  uint32_t  Prescaler;          /*!< Configures the LCD Prescaler.
                                    This parameter can be one value of @ref LCD_Prescaler */
  uint32_t  Divider;            /*!< Configures the LCD Divider.
                                    This parameter can be one value of @ref LCD_Divider */
  uint32_t  Duty;               /*!< Configures the LCD Duty.
                                    This parameter can be one value of @ref LCD_Duty */
  uint32_t  Bias;               /*!< Configures the LCD Bias.
                                    This parameter can be one value of @ref LCD_Bias */
  uint32_t  VoltageSource;      /*!< Selects the LCD Voltage source.
                                    This parameter can be one value of @ref LCD_Voltage_source */
  uint32_t  Contrast;           /*!< Configures the LCD Contrast.
                                    This parameter can be one value of @ref LCD_Contrast */
  uint32_t  DeadTime;           /*!< Configures the LCD Dead Time.
                                    This parameter can be one value of @ref LCD_DeadTime */
  uint32_t  PulseOnDuration;    /*!< Configures the LCD Pulse On Duration.
                                    This parameter can be one value of @ref LCD_PulseOnDuration */
  uint32_t  HighDrive;          /*!< Enable or disable the permanent high driver.
                                    This parameter can be one value of @ref LCD_HighDrive */
  uint32_t  HighDriveBuffer;    /*!< Enable or disable the high driver buffer.
                                    This parameter can be one value of @ref LCD_HighDrive_Buffer */
  uint32_t  BlinkMode;          /*!< Configures the LCD Blink Mode.
                                    This parameter can be one value of @ref LCD_Blink_Mode */
  uint32_t  BlinkFreq;          /*!< Configures the LCD Blink frequency.
                                    This parameter can be one value of @ref LCD_Blink_Frequency */
  uint32_t  MuxSegment;         /*!< Enable or disable mux segment.
                                    This parameter can be one value of @ref LCD_MuxSegment */
}LCD_InitType;


/** @addtogroup LCD_Exported_Functions
  * @{
  */
LCD_ErrorTypeDef LCD_Init(LCD_InitType *LCD_InitStructure );
void LCD_DeInit(void);

LCD_ErrorTypeDef LCD_ClockConfig(uint32_t LCD_ClkSource);

void LCD_RamClear(void);

LCD_ErrorTypeDef LCD_UpdateDisplayRequest(void);

LCD_ErrorTypeDef LCD_Write(uint32_t RAMRegisterIndex,uint32_t RAMRegisterMask,uint32_t RAMData);


LCD_ErrorTypeDef LCD_SetBit(uint32_t RAMRegisterIndex,uint32_t RAMData);

LCD_ErrorTypeDef LCD_ClearBit(uint32_t RAMRegisterIndex,uint32_t RAMData);

LCD_ErrorTypeDef LCD_WaitForSynchro(void);

/**
  * @}
  */



#ifdef __cplusplus
 }
#endif

#endif /* __N32L40X_LCD_H__ */
 /**
  * @}
  */

 /**
  * @}
  */

 /**
  * @}
  */


